Feat: Updated Architecural Diagrams
